ConnectTest/src/Catalogs/classesSchedule/classesSchedule.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>classesSchedule</name>
  <attributes>
    <name>period</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>gym</name>
    <type>
      <types>CatalogRef.gyms</types>
    </type>
  </attributes>
  <attributes>
    <name>fullDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>active</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/Catalogs/classesSchedule/ManagerModule.bsl
Function attributesStructure() Export

	attributesTableForNewItem = data.getValueTable();
	
	attributesTable = data.getValueTable();
	data.addRowInAttributesTable(attributesTable, "period", "period", "date");
	data.addRowInAttributesTable(attributesTable, "active", "active", "boolean");
	data.addRowInAttributesTable(attributesTable, "gym", "gym", "ref");
	data.addRowInAttributesTable(attributesTable, "fullDescription", "fullDescription", "JSON");
	data.addRowInAttributesTable(attributesTable, "translation", "translation", "valueTable");
	
	attributesTranslation = data.getValueTable();
	data.addRowInAttributesTable(attributesTranslation, "language", "language", "ref");
	data.addRowInAttributesTable(attributesTranslation, "fullDescription", "fullDescription", "JSON");
	
	gymStruct = New Structure();
	gymStruct.Insert("gyms", "uid");

	mdStruct = New Structure();
	mdStruct.Insert("gym", gymStruct);
	mdStruct.Insert("translation", attributesTranslation);
	
	Return New Structure("mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", "classesSchedule", "catalog", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
